riqi='2023-01-15'
dafeng_city='鞍山,龙岩,丽水,本溪,舟山,七台河,朔州,汕尾,鹤岗,抚顺,潮州,延安,平凉,毕节,威海,锦州,佳木斯,东营,白山,大庆,丽江,葫芦岛,呼伦贝尔,巴彦淖尔,临沧,普洱,北海,漳州,海口,上海,东莞,中山,临沂,乌鲁木齐,佛山,保定,兰州,北京,南京,南充,南宁,南昌,南通,南阳,厦门,台州,合肥,呼和浩特,咸阳,哈尔滨,唐山,嘉兴,大同,大连,天津,太原,宁波,宿迁,常州,广州,廊坊,张家口,徐州,德州,德阳,惠州,成都,扬州,新乡,无锡,昆明,杭州,柳州,桂林,武汉,汕头,江门,沈阳,沧州,泉州,泰安,泰州,洛阳,济南,济宁,淄博,淮安,深圳,清远,温州,湖州,湛江,滁州,潍坊,烟台,珠海,盐城,石家庄,福州,秦皇岛,绍兴,绵阳,肇庆,芜湖,苏州,茂名,衡阳,西宁,西安,贵阳,赣州,连云港,邢台,邯郸,郑州,鄂尔多斯,重庆,金华,银川,镇江,长春,长沙,青岛,韶关'.split(',')
dafeng_city_old='邢台,保定,达州,北京,廊坊,石家庄,唐山,邯郸,洛阳,新乡,兰州,遂宁,资阳,绵阳,十堰,德阳,成都,沈阳,秦皇岛,天津,昆明,张家口,开封,武汉,衡水,沧州,黄石,襄阳,鄂州,鹤壁,南充,营口,张掖,西宁,重庆,安阳,三门峡,广安,丹东,铁岭,抚顺,郴州,盘锦,衡阳,荆州,眉山,朝阳,泸州,黄冈,孝感,商丘,巴中,白银,大连,荆门,长春,郑州,信阳,松原,周口,南阳,辽源,本溪,辽阳,鞍山,自贡,乐山,马鞍山,吕梁,阜新,景德镇,海东,天水,徐州,武威,濮阳,随州,内江,焦作,阳泉,定西,庆阳,亳州,西安,济南,攀枝花,雅安,通辽,承德,阜阳,许昌,平顶山'.split(',')
jidui_city=['北京','石家庄','保定','广州','武汉','上海']

